# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\DIEN-GIAO-THONG\circuit_X_ray\work_done\code\test_draw_altium\test_draw_altium.cydsn\test_draw_altium.cyprj
# Date: Thu, 08 Sep 2022 11:01:00 GMT
#set_units -time ns
create_clock -name {adc_intClock(FFB)} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/ff_div_10}]]
create_clock -name {uart_SCBCLK(FFB)} -period 729.16666666666663 -waveform {0 364.583333333333} [list [get_pins {ClockBlock/ff_div_5}]]
create_clock -name {CyRouted1} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {adc_intClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 7 13} [list]
create_generated_clock -name {uart_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 35 71} [list]


# Component constraints for D:\DIEN-GIAO-THONG\circuit_X_ray\work_done\code\test_draw_altium\test_draw_altium.cydsn\TopDesign\TopDesign.cysch
# Project: D:\DIEN-GIAO-THONG\circuit_X_ray\work_done\code\test_draw_altium\test_draw_altium.cydsn\test_draw_altium.cyprj
# Date: Thu, 08 Sep 2022 11:00:55 GMT
